pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2.74";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
256
(
(0.015838563 -0.00240654941 0.00512019043)
(-0.00614733038 -0.00426989074 -0.103780315)
(0.0148940273 -0.0044226052 0.0102106244)
(0.0159308143 -0.00393811515 -0.0517063926)
(-0.00739394367 0.00905001986 0.177715178)
(-0.00906804092 0.0324788954 0.0991578994)
(0.0206468927 0.0058610249 0.241711238)
(0.0138596282 0.0103254788 0.211874469)
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
    }
    pout
    {
        type            cyclic;
    }
    w_F
    {
        type            cyclic;
    }
    w_B
    {
        type            cyclic;
    }
    w_L
    {
        type            cyclic;
    }
    w_R
    {
        type            cyclic;
    }
}


// ************************************************************************* //
