pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/U.airMean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2.74";
    object      U.airMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
256
(
(-3.14010632e-05 0.00617206175 0.0992313226)
(-0.000662635233 0.00657627673 0.0920612827)
(0.00373596099 0.00209114373 0.0808184573)
(-0.000689602475 0.00123855806 0.0862873739)
(-0.0029291476 0.00300150726 0.0986164657)
(-0.000526899382 0.000310356435 0.0917333046)
(0.00700589248 -0.00164760306 0.0955056858)
(-0.000277291788 0.000115442017 0.102832558)
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
    }
    pout
    {
        type            cyclic;
    }
    w_F
    {
        type            cyclic;
    }
    w_B
    {
        type            cyclic;
    }
    w_L
    {
        type            cyclic;
    }
    w_R
    {
        type            cyclic;
    }
}


// ************************************************************************* //
