pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2.74";
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
256
(
0.866517444
0.777097745
0.857196321
0.777097745
0.886444436
0.835964183
0.887508892
0.869476977
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
    }
    pout
    {
        type            cyclic;
    }
    w_F
    {
        type            cyclic;
    }
    w_B
    {
        type            cyclic;
    }
    w_L
    {
        type            cyclic;
    }
    w_R
    {
        type            cyclic;
    }
}


// ************************************************************************* //
