pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/alpha.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2.74";
    object      alpha.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
256
(
0.133482556
0.222902255
0.142803679
0.222902255
0.113555564
0.164035817
0.112491108
0.130523023
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
    }
    pout
    {
        type            cyclic;
    }
    w_F
    {
        type            cyclic;
    }
    w_B
    {
        type            cyclic;
    }
    w_L
    {
        type            cyclic;
    }
    w_R
    {
        type            cyclic;
    }
}


// ************************************************************************* //
