pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/dgdt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2.74";
    object      dgdt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
256
(
-8.84078913e-06
-2.45420353e-05
-9.46817194e-06
-5.06228697e-05
7.9461226e-07
-3.19964676e-07
3.44440893e-07
-8.33794147e-06
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
    }
    pout
    {
        type            cyclic;
    }
    w_F
    {
        type            cyclic;
    }
    w_B
    {
        type            cyclic;
    }
    w_L
    {
        type            cyclic;
    }
    w_R
    {
        type            cyclic;
    }
}


// ************************************************************************* //
