pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "2.74";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
624
(
-4.19298945e-08
-4.08626626e-08
1.70978656e-07
8.41124634e-08
3.62041408e-08
-4.12135787e-07
1.99766727e-09
-5.12931474e-08
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
6.57050091e-08
-6.56913814e-07
4.544219e-08
-9.23589963e-07
1.9255683e-07
-5.1229903e-07
2.47189291e-07
-6.61803004e-07
-4.84927107e-08
-9.5644061e-07
1.14344211e-08
-1.03054346e-06
6.88622577e-08
-8.56468357e-07
6.29084489e-08
-1.00149181e-06
)
;
    }
    pout
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
-6.57050091e-08
6.56913814e-07
-4.544219e-08
9.23589963e-07
-1.9255683e-07
5.1229903e-07
-2.47189291e-07
6.61803004e-07
4.84927107e-08
9.5644061e-07
-1.14344211e-08
1.03054346e-06
-6.88622577e-08
8.56468357e-07
-6.29084489e-08
1.00149181e-06
)
;
    }
    w_F
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-3.35933646e-08
-6.35703673e-08
-7.15465193e-08
-9.11363381e-08
-1.00847799e-07
-9.30238315e-08
-4.41109709e-08
3.74209233e-09
...
)
;
    }
    w_B
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
3.35933646e-08
6.35703673e-08
7.15465193e-08
9.11363381e-08
1.00847799e-07
9.30238315e-08
4.41109709e-08
-3.74209233e-09
...
)
;
    }
    w_L
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
1.20297213e-07
6.19738432e-08
1.2935843e-07
9.9600233e-08
2.43051909e-08
3.26041909e-08
1.04457451e-07
5.06413963e-08
...
)
;
    }
    w_R
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-1.20297213e-07
-6.19738432e-08
-1.2935843e-07
-9.9600233e-08
-2.43051909e-08
-3.26041909e-08
-1.04457451e-07
-5.06413963e-08
...
)
;
    }
}


// ************************************************************************* //
