pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/phi.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "2.74";
    object      phi.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
624
(
-5.37412158e-08
-4.85771217e-08
2.27390949e-07
9.75533588e-08
3.25250763e-08
-3.6537047e-07
-9.02045687e-09
-6.08348005e-08
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
1.215157e-08
-7.16055921e-07
-2.30276831e-09
-9.84068865e-07
1.48436534e-07
-5.60318638e-07
2.04636143e-07
-7.13958104e-07
-1.03821274e-07
-1.01663642e-06
-2.91810091e-08
-1.09432885e-06
2.75272007e-08
-9.12492865e-07
2.36267557e-08
-1.0599783e-06
)
;
    }
    pout
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
-1.215157e-08
7.16055921e-07
2.30276831e-09
9.84068865e-07
-1.48436534e-07
5.60318638e-07
-2.04636143e-07
7.13958104e-07
1.03821274e-07
1.01663642e-06
2.91810091e-08
1.09432885e-06
-2.75272007e-08
9.12492865e-07
-2.36267557e-08
1.0599783e-06
)
;
    }
    w_F
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-3.9932612e-08
-7.26678708e-08
-7.99511144e-08
-1.00313385e-07
-1.13448618e-07
-1.06422188e-07
-5.18302852e-08
-7.2974404e-11
...
)
;
    }
    w_B
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
3.9932612e-08
7.26678708e-08
7.99511144e-08
1.00313385e-07
1.13448618e-07
1.06422188e-07
5.18302852e-08
7.2974404e-11
...
)
;
    }
    w_L
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
1.29758199e-07
6.65770622e-08
1.34689225e-07
1.04519664e-07
2.17663107e-08
3.60343345e-08
1.03564163e-07
5.28443556e-08
...
)
;
    }
    w_R
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-1.29758199e-07
-6.65770622e-08
-1.34689225e-07
-1.04519664e-07
-2.17663107e-08
-3.60343345e-08
-1.03564163e-07
-5.28443556e-08
...
)
;
    }
}


// ************************************************************************* //
