pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/heatTransferPeriodicBox/0.heat/phi.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "2.74";
    object      phi.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
624
(
1.25428737e-08
1.3878495e-08
-2.39468546e-07
2.40467831e-08
5.15413728e-08
-5.99882597e-07
5.12362857e-08
1.39152816e-08
...
)
;

boundaryField
{
    vin_DB
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
3.49687974e-07
-1.93596693e-07
2.72220201e-07
-4.21127986e-07
3.46401503e-07
-2.39242809e-07
4.28496647e-07
-3.33993775e-07
1.98766384e-07
-4.81318175e-07
1.81503706e-07
-4.99090672e-07
2.12995077e-07
-4.75141871e-07
2.00646696e-07
-5.87880829e-07
)
;
    }
    pout
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
-3.49687974e-07
1.93596693e-07
-2.72220201e-07
4.21127986e-07
-3.46401503e-07
2.39242809e-07
-4.28496647e-07
3.33993775e-07
-1.98766384e-07
4.81318175e-07
-1.81503706e-07
4.99090672e-07
-2.12995077e-07
4.75141871e-07
-2.00646696e-07
5.87880829e-07
)
;
    }
    w_F
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
1.26135427e-08
1.10030989e-08
-3.85849421e-09
-2.07296932e-08
-1.4659385e-08
-1.29608698e-08
-3.24043195e-09
2.22204525e-08
...
)
;
    }
    w_B
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-1.26135427e-08
-1.10030989e-08
3.85849421e-09
2.07296932e-08
1.4659385e-08
1.29608698e-08
3.24043195e-09
-2.22204525e-08
...
)
;
    }
    w_L
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
7.66639851e-08
2.88579071e-08
1.06938438e-07
6.26646119e-08
4.020558e-08
1.06967209e-08
1.09579155e-07
3.50875206e-08
...
)
;
    }
    w_R
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-7.66639851e-08
-2.88579071e-08
-1.06938438e-07
-6.26646119e-08
-4.020558e-08
-1.06967209e-08
-1.09579155e-07
-3.50875206e-08
...
)
;
    }
}


// ************************************************************************* //
